# Merging, Joining and Concatenating

In [1]:
import pandas as pd

In [8]:
week1 = pd.read_csv("Restaurant - Week 1 Sales.csv")
week2 = pd.read_csv("Restaurant - Week 2 Sales.csv")
customers = pd.read_csv("Restaurant - Customers.csv")
foods = pd.read_csv("Restaurant - Foods.csv")

In [6]:
week1.head(3)

   Customer ID  Food ID
0          537        9
1           97        4
2          658        1

## The pd.concat Method - Part I

In [9]:
week1 = pd.read_csv("Restaurant - Week 1 Sales.csv")
week2 = pd.read_csv("Restaurant - Week 2 Sales.csv")
customers = pd.read_csv("Restaurant - Customers.csv")
foods = pd.read_csv("Restaurant - Foods.csv")

In [10]:
week1.head(3)

   Customer ID  Food ID
0          537        9
1           97        4
2          658        1

In [11]:
week2.head(3)

   Customer ID  Food ID
0          688       10
1          813        7
2          495       10

In [15]:
len(week1)

250

In [16]:
len(week2)

250

In [18]:
pd.concat([week1, week2])
pd.concat([week1, week2], ignore_index=False) # Maintain the old index of each dataframe
pd.concat([week1, week2], ignore_index=True) # Creat a new Index

     Customer ID  Food ID
0            537        9
1             97        4
2            658        1
3            202        2
4            155        9
..           ...      ...
495          783       10
496          556       10
497          547        9
498          252        9
499          249        6

[500 rows x 2 columns]

Alternative method to concatenate

In [20]:
week1.append(week2, ignore_index=True)

     Customer ID  Food ID
0            537        9
1             97        4
2            658        1
3            202        2
4            155        9
..           ...      ...
495          783       10
496          556       10
497          547        9
498          252        9
499          249        6

[500 rows x 2 columns]

## The pd.concat Method - Part II

In [21]:
week1 = pd.read_csv("Restaurant - Week 1 Sales.csv")
week2 = pd.read_csv("Restaurant - Week 2 Sales.csv")
customers = pd.read_csv("Restaurant - Customers.csv")
foods = pd.read_csv("Restaurant - Foods.csv")

In [36]:
sales = pd.concat(objs=[week1,week2], keys = ["Week 1", "Week 2"]) # MultIndex dataframe
sales.head(3)

          Customer ID  Food ID
Week 1 0          537        9
       1           97        4
       2          658        1

In [35]:
sales.loc[("Week 1",)]
sales.loc[("Week 2",)]

sales.loc[("Week 1", 240)]
sales.loc[("Week 2", 129)]

sales.loc[("Week 1", 240), "Customer ID"]
sales.loc[("Week 1", 240), ["Customer ID", "Food ID"]]

Customer ID    945
Food ID          5
Name: (Week 1, 240), dtype: int64

## Inner Joins - Part I

In [39]:
week1 = pd.read_csv("Restaurant - Week 1 Sales.csv")
week2 = pd.read_csv("Restaurant - Week 2 Sales.csv")
customers = pd.read_csv("Restaurant - Customers.csv")
foods = pd.read_csv("Restaurant - Foods.csv")

In [40]:
week1.head(3)

   Customer ID  Food ID
0          537        9
1           97        4
2          658        1

In [41]:
week2.head(3)

   Customer ID  Food ID
0          688       10
1          813        7
2          495       10

In [44]:
week1.merge(week2, how="inner", on="Customer ID").head(4)

   Customer ID  Food ID_x  Food ID_y
0          537          9          5
1          155          9          3
2          155          1          3
3          503          5          8

Same Customer, two different weeks

In [45]:
week1[week1["Customer ID"] == 155]

    Customer ID  Food ID
4           155        9
17          155        1

In [46]:
week2[week2["Customer ID"] == 155]

     Customer ID  Food ID
208          155        3

In [48]:
week1.merge(week2, how="inner", on="Customer ID", suffixes= [" - Week 1", " - Week 2"]).head(4)

   Customer ID  Food ID - Week 1  Food ID - Week 2
0          537                 9                 5
1          155                 9                 3
2          155                 1                 3
3          503                 5                 8

## Inner Joins - Part II

In [49]:
week1 = pd.read_csv("Restaurant - Week 1 Sales.csv")
week2 = pd.read_csv("Restaurant - Week 2 Sales.csv")
customers = pd.read_csv("Restaurant - Customers.csv")
foods = pd.read_csv("Restaurant - Foods.csv")

Same customer, ordering the same food on the two weeks

In [52]:
week1.merge(week2, how="inner", on= ["Customer ID", "Food ID"])

   Customer ID  Food ID
0          304        3
1          540        3
2          937       10
3          233        3
4           21        4
5           21        4
6          922        1
7          578        5
8          578        5

In [53]:
week1[week1["Customer ID"] == 21]

     Customer ID  Food ID
101           21        4
212           21        4

In [54]:
week2[week2["Customer ID"] == 21]

    Customer ID  Food ID
30           21        4

## Outer Joins

In [55]:
week1 = pd.read_csv("Restaurant - Week 1 Sales.csv")
week2 = pd.read_csv("Restaurant - Week 2 Sales.csv")
customers = pd.read_csv("Restaurant - Customers.csv")
foods = pd.read_csv("Restaurant - Foods.csv")

Only works because we have the same parameters between the two dataframes.
When we have a NaN, the customer didn't order anything that week

In [57]:
week1.merge(week2, how="outer", on="Customer ID", suffixes= [" - Week 1", " - Week 2"])

     Customer ID  Food ID - Week 1  Food ID - Week 2
0            537               9.0               5.0
1             97               4.0               NaN
2            658               1.0               NaN
3            202               2.0               NaN
4            155               9.0               3.0
..           ...               ...               ...
449          855               NaN               4.0
450          559               NaN              10.0
451          276               NaN               4.0
452          556               NaN              10.0
453          252               NaN               9.0

[454 rows x 3 columns]

In [59]:
len(week1.merge(week2, how="outer", on="Customer ID", suffixes= [" - Week 1", " - Week 2"]))

454

In [ ]:
week1[week1["Customer ID"] == 537]

     Customer ID  Food ID
101           21        4
212           21        4

In [58]:
week2[week2["Customer ID"] == 537]

    Customer ID  Food ID
42          537        5

indicator=True \
Will indicate from where the valid data was found

In [62]:
merged = week1.merge(week2, how="outer", on="Customer ID", suffixes= [" - Week 1", " - Week 2"], indicator=True)

In [63]:
merged["_merge"].value_counts

<bound method IndexOpsMixin.value_counts of 0            both
1       left_only
2       left_only
3       left_only
4            both
          ...
449    right_only
450    right_only
451    right_only
452    right_only
453    right_only
Name: _merge, Length: 454, dtype: category
Categories (3, object): ['left_only', 'right_only', 'both']>

In [64]:
merged

     Customer ID  Food ID - Week 1  Food ID - Week 2      _merge
0            537               9.0               5.0        both
1             97               4.0               NaN   left_only
2            658               1.0               NaN   left_only
3            202               2.0               NaN   left_only
4            155               9.0               3.0        both
..           ...               ...               ...         ...
449          855               NaN               4.0  right_only
450          559               NaN              10.0  right_only
451          276               NaN               4.0  right_only
452          556               NaN              10.0  right_only
453          252               NaN               9.0  right_only

[454 rows x 4 columns]

This mask will get only the OUTER series

In [67]:
mask = merged["_merge"].isin(["left_only", "right_only"])

In [68]:
merged[mask]

     Customer ID  Food ID - Week 1  Food ID - Week 2      _merge
1             97               4.0               NaN   left_only
2            658               1.0               NaN   left_only
3            202               2.0               NaN   left_only
6            213               8.0               NaN   left_only
7            600               1.0               NaN   left_only
..           ...               ...               ...         ...
449          855               NaN               4.0  right_only
450          559               NaN              10.0  right_only
451          276               NaN               4.0  right_only
452          556               NaN              10.0  right_only
453          252               NaN               9.0  right_only

[392 rows x 4 columns]

## Left Joins

In [69]:
week1 = pd.read_csv("Restaurant - Week 1 Sales.csv")
week2 = pd.read_csv("Restaurant - Week 2 Sales.csv")
customers = pd.read_csv("Restaurant - Customers.csv")
foods = pd.read_csv("Restaurant - Foods.csv")

In [72]:
week1.head(3)

   Customer ID  Food ID
0          537        9
1           97        4
2          658        1

If the Food ID isn't on the "right column" (foods), it would appear as NaN on our left join result dataframe

In [73]:
week1.merge(foods, how="left", on="Food ID", sort=True) # We can sort the column that matches ("on=" attribute)

     Customer ID  Food ID Food Item  Price
0            658        1     Sushi   3.99
1            600        1     Sushi   3.99
2            155        1     Sushi   3.99
3            341        1     Sushi   3.99
4             20        1     Sushi   3.99
..           ...      ...       ...    ...
245          809       10     Drink   1.75
246          584       10     Drink   1.75
247          274       10     Drink   1.75
248          151       10     Drink   1.75
249          535       10     Drink   1.75

[250 rows x 4 columns]

## The left_on and right_on Parameters

In [80]:
week1 = pd.read_csv("Restaurant - Week 1 Sales.csv")
week2 = pd.read_csv("Restaurant - Week 2 Sales.csv")
customers = pd.read_csv("Restaurant - Customers.csv")
foods = pd.read_csv("Restaurant - Foods.csv")

In [81]:
week2.head()

   Customer ID  Food ID
0          688       10
1          813        7
2          495       10
3          189        5
4          267        3

In [82]:
customers.head(3)

   ID First Name Last Name  Gender  Company                     Occupation
0   1     Joseph   Perkins    Male  Dynazzy  Community Outreach Specialist
1   2   Jennifer   Alvarez  Female     DabZ        Senior Quality Engineer
2   3      Roger     Black    Male  Tagfeed              Account Executive

In [84]:
week2.merge(customers, how= "left", left_on= "Customer ID", right_on="ID")
# We can check if Customer ID and ID were properly merged, but it is not necessary for our dataframe viz

,Customer ID,Food ID,ID,First Name,Last Name,Gender,Company,Occupation
0,688,10,688,Carl,Williamson,Male,Thoughtmix,Graphic Designer
1,813,7,813,Johnny,Walker,Male,Kayveo,Developer II
2,495,10,495,Deborah,Little,Female,Babbleblab,VP Accounting
3,189,5,189,Roger,Gordon,Male,Skilith,Operator
4,267,3,267,Matthew,Wood,Male,Agimba,Product Engineer
...,...,...,...,...,...,...,...,...
245,783,10,783,Phyllis,Meyer,Female,Voolia,Information Systems Manager
246,556,10,556,Samuel,Bailey,Male,Oyoloo,Nurse
247,547,9,547,Tina,Watkins,Female,Thoughtstorm,Accountant II
248,252,9,252,Douglas,Powell,Male,Jetwire,Geologist IV
249,249,6,249,Anthony,Carpenter,Male,Shuffletag,Health Coach I

When we use left_on and right_on, both columns will be keep on the final dataframe

In [87]:
week2.merge(customers, how= "left", left_on= "Customer ID", right_on="ID").drop("ID", axis="columns")
# We can check if Customer ID and ID were properly merged

,Customer ID,Food ID,First Name,Last Name,Gender,Company,Occupation
0,688,10,Carl,Williamson,Male,Thoughtmix,Graphic Designer
1,813,7,Johnny,Walker,Male,Kayveo,Developer II
2,495,10,Deborah,Little,Female,Babbleblab,VP Accounting
3,189,5,Roger,Gordon,Male,Skilith,Operator
4,267,3,Matthew,Wood,Male,Agimba,Product Engineer
...,...,...,...,...,...,...,...
245,783,10,Phyllis,Meyer,Female,Voolia,Information Systems Manager
246,556,10,Samuel,Bailey,Male,Oyoloo,Nurse
247,547,9,Tina,Watkins,Female,Thoughtstorm,Accountant II
248,252,9,Douglas,Powell,Male,Jetwire,Geologist IV
249,249,6,Anthony,Carpenter,Male,Shuffletag,Health Coach I

## Merging by Indexes with the left_index and right_index Parameters

In [92]:
week1 = pd.read_csv("Restaurant - Week 1 Sales.csv")
week2 = pd.read_csv("Restaurant - Week 2 Sales.csv")
customers = pd.read_csv("Restaurant - Customers.csv", index_col= "ID")
foods = pd.read_csv("Restaurant - Foods.csv", index_col= "Food ID")

In [90]:
customers.head()

   First Name Last Name  Gender  Company                     Occupation
ID
1      Joseph   Perkins    Male  Dynazzy  Community Outreach Specialist
2    Jennifer   Alvarez  Female     DabZ        Senior Quality Engineer
3       Roger     Black    Male  Tagfeed              Account Executive
4      Steven     Evans    Male     Fatz               Registered Nurse
5        Judy  Morrison  Female  Demivee                Legal Assistant

In [94]:
foods.head(3)

        Food Item  Price
Food ID
1           Sushi   3.99
2         Burrito   9.99
3            Taco   2.99

When it's not a column we want to perform a left join, right_on will not work. So we'll have to use another parameter.

right_index will match perfectly with our setted index.

When using indexes merge, the duplicate columns do not appear.

In [97]:
sales = week1.merge(customers, how= "left", left_on= "Customer ID", right_index= True)
sales = sales.merge(foods, how= "left", left_on= "Food ID", right_index=True)
sales.head(3)

,Customer ID,Food ID,First Name,Last Name,Gender,Company,Occupation,Food Item,Price
0,537,9,Cheryl,Carroll,Female,Zoombeat,Registered Nurse,Donut,0.99
1,97,4,Amanda,Watkins,Female,Ozu,Account Coordinator,Quesadilla,4.25
2,658,1,Patrick,Webb,Male,Browsebug,Community Outreach Specialist,Sushi,3.99

Merge based on index (based on the first from last order)

In [98]:
week1.head(3)

   Customer ID  Food ID
0          537        9
1           97        4
2          658        1

In [99]:
week2.head(3)

   Customer ID  Food ID
0          688       10
1          813        7
2          495       10

We can use left_on or right_on on this case

In [103]:
week1.merge(week2, how= "left", left_index= True, right_index= True, suffixes= [" - Week 1", " - Week 2"])

,Customer ID - Week 1,Food ID - Week 1,Customer ID - Week 2,Food ID - Week 2
0,537,9,688,10
1,97,4,813,7
2,658,1,495,10
3,202,2,189,5
4,155,9,267,3
...,...,...,...,...
245,413,9,783,10
246,926,6,556,10
247,134,3,547,9
248,396,6,252,9
249,535,10,249,6

## The join() Method

In [106]:
week1 = pd.read_csv("Restaurant - Week 1 Sales.csv")
week2 = pd.read_csv("Restaurant - Week 2 Sales.csv")
customers = pd.read_csv("Restaurant - Customers.csv")
foods = pd.read_csv("Restaurant - Foods.csv")
satisfaction = pd.read_csv("Restaurant - Week 1 Satisfaction.csv") # how much client enjoyed their meal

In [107]:
week1.head(3)

   Customer ID  Food ID
0          537        9
1           97        4
2          658        1

In [108]:
satisfaction.head(3)

   Satisfaction Rating
0                    2
1                    7
2                    3

In [109]:
week1.merge(satisfaction, how= "left", left_index= True, right_index= True)

     Customer ID  Food ID  Satisfaction Rating
0            537        9                    2
1             97        4                    7
2            658        1                    3
3            202        2                    7
4            155        9                   10
..           ...      ...                  ...
245          413        9                    1
246          926        6                    2
247          134        3                    8
248          396        6                   10
249          535       10                    3

[250 rows x 3 columns]

Will join based on the index by default

In [110]:
week1.join(satisfaction)

     Customer ID  Food ID  Satisfaction Rating
0            537        9                    2
1             97        4                    7
2            658        1                    3
3            202        2                    7
4            155        9                   10
..           ...      ...                  ...
245          413        9                    1
246          926        6                    2
247          134        3                    8
248          396        6                   10
249          535       10                    3

[250 rows x 3 columns]

## The pd.merge() Method

In [111]:
week1 = pd.read_csv("Restaurant - Week 1 Sales.csv")
week2 = pd.read_csv("Restaurant - Week 2 Sales.csv")
customers = pd.read_csv("Restaurant - Customers.csv")
foods = pd.read_csv("Restaurant - Foods.csv")
satisfaction = pd.read_csv("Restaurant - Week 1 Satisfaction.csv") # how much client enjoyed their meal

In [112]:
week1.head(3)

   Customer ID  Food ID
0          537        9
1           97        4
2          658        1

In [113]:
customers.head(3)

   ID First Name Last Name  Gender  Company                     Occupation
0   1     Joseph   Perkins    Male  Dynazzy  Community Outreach Specialist
1   2   Jennifer   Alvarez  Female     DabZ        Senior Quality Engineer
2   3      Roger     Black    Male  Tagfeed              Account Executive

In [116]:
# week1.merge(customers).... tralala
pd.merge(week1, customers, how= "left", left_on= "Customer ID", right_on= "ID")

,Customer ID,Food ID,ID,First Name,Last Name,Gender,Company,Occupation
0,537,9,537,Cheryl,Carroll,Female,Zoombeat,Registered Nurse
1,97,4,97,Amanda,Watkins,Female,Ozu,Account Coordinator
2,658,1,658,Patrick,Webb,Male,Browsebug,Community Outreach Specialist
3,202,2,202,Louis,Campbell,Male,Rhynoodle,Account Representative III
4,155,9,155,Carolyn,Diaz,Female,Gigazoom,Database Administrator III
...,...,...,...,...,...,...,...,...
245,413,9,413,Diane,Bailey,Female,Wikibox,Technical Writer
246,926,6,926,Anne,Wagner,Female,Skyba,Legal Assistant
247,134,3,134,Diana,Hall,Female,Quinu,Financial Advisor
248,396,6,396,Juan,Romero,Male,Zoonder,Analyst Programmer
249,535,10,535,Nancy,Cox,Female,Trudeo,Research Associate